In [2]:
# Tipo de datos en Pandas>
# Series
# DataFrames
import pandas as pd

In [4]:
datos = {"nombre": ["Pedro", "Juan", "Lorena"], "edad": [25, 39, 33]}
datos

{'nombre': ['Pedro', 'Juan', 'Lorena'], 'edad': [25, 39, 33]}

In [10]:
# MÃ©todo DataFrame que sirve para transformar conjunto de datos en un dataframe de pandas
# Las series son las columnas de lo dataFrames
df = pd.DataFrame(datos)
df

   nombre  edad
0   Pedro    25
1    Juan    39
2  Lorena    33

In [12]:
type(df)

pandas.core.frame.DataFrame

In [ ]:

df["nombre"]

In [ ]:
df.nombre

In [ ]:
type(df.nombre)